# 1) У вас є список my_list із значеннями типу int. Роздрукувати значення, які більше 100.
   # Завдання виконати за допомогою циклу for.

my_list = [10, 20, 30, 100, 120, 130]

for num in my_list:
   if num >100:
      print(num)


# 2) У вас є список my_list зі значеннями типу int і порожній список my_results. Додати в my_results ті значення,
#    які більше 100. Роздрукувати список my_results. Завдання виконати за допомогою циклу for.

my_list = [10, 20, 30, 100, 120, 130]
my_results = []
for num in my_list:
   if num >100:
      my_results.append(num)
      print(my_results)

# 3) У вас є список my_list із значеннями типу int. Якщо my_list кількість елементів менше 2,
#    то в кінець додати значення 0. Якщо кількість елементів більша або дорівнює 2,
#    то додати суму останніх двох елементів. Кількість елементів у списку можна отримати за допомогою функції len(my_list)

my_list = [10, 20, 30, 100, 120, 130]
if len (my_list) <2:
      my_list.append (0)
else:
   my_list.append(my_list[-1] + my_list[-2])
   print(my_list)